app/controllers/image_comments_controller.rb

  def index
    @image_comments = ImageComment.all
---
SELECT "image_comments".* FROM "image_comments"

  def create
    @image_comment = ImageComment.new(image_comment_params)
    @image_comment.user_id = current_user.id
    respond_to do |format|
      if @image_comment.save
---
INSERT INTO "image_comments" ("image_id", "comment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image_id", 2], ["comment", ";lsdfk;lskf;lsdkfsdkf;lsd"], ["user_id", 1], ["created_at", "2017-04-18 03:52:19.481438"], ["updated_at", "2017-04-18 03:52:19.481438"]]

  def destroy
    @image_comment.destroy
---
DELETE FROM "image_comments" WHERE "image_comments"."id" = ?  [["id", 2]]

    def set_image_comment
      @image_comment = ImageComment.find(params[:id])
---
SELECT  "image_comments".* FROM "image_comments" WHERE "image_comments"."id" = ? LIMIT 1  [["id", 2]]