app/controllers/images_controller.rb

INSERT INTO "images" ("title", "file", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello"], ["file", "IMG_20170415_101730.jpg"], ["user_id", 1], ["created_at", "2017-04-18 03:43:30.360352"], ["updated_at", "2017-04-18 03:43:30.360352"]]
---
  def create
    @image = Image.new(image_params)
    @image.user_id = current_user.id
    respond_to do |format|
      if @image.save

DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image.destroy