app/views/images/show.html.erb

<ul>
 <% @image.image_comment.each do |image_comment|%>
---
SELECT "image_comments".* FROM "image_comments" WHERE "image_comments"."image_id" = ?  ORDER BY created_at DESC  [["image_id", 2]]